pitlab/Kamera-OV9655-na-STM32F746G-DISCO/Core/Src/main.c
  /*Configure GPIO pins : TP3_Pin NC2_Pin */
  GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pin : DCMI_PWR_EN_Pin */
  GPIO_InitStruct.Pin = DCMI_PWR_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DCMI_PWR_EN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_D4_Pin ARDUINO_D2_Pin EXT_RST_Pin */
  GPIO_InitStruct.Pin = ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void vApplicationIdleHook( void )
{

}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_HOST */
  MX_USB_HOST_Init();

  /* init code for LWIP */
  MX_LWIP_Init();
  /* USER CODE BEGIN 5 */
  const char* message = "Hello UDP message!\n\r";
  //static uint8_t bufor_kamery[1280 * 1024 * 2] __attribute__((section(".BuforKamery")));
  static uint8_t bufor_okna[320 * 240 * 2] __attribute__((section(".BuforLCD1")));
  //static uint8_t bufor_ekranu[480 * 272 * 4] __attribute__((section(".BuforLCD0")));
  char chNapis[70];
  uint8_t chZrobione = 0;
  uint8_t n, chFilm = 0;
  TS_StateTypeDef touch;
  extern float fImag;
  uint8_t chStartFraktal = 0;
  uint32_t nCzas;

  struct etharp_entry {
  #if ARP_QUEUEING
    /** Pointer to queue of pending outgoing packets on this ARP entry. */
    struct etharp_q_entry *q;
  #else /* ARP_QUEUEING */
    /** Pointer to a single pending outgoing packet on this ARP entry. */
    struct pbuf *q;
  #endif /* ARP_QUEUEING */
    ip4_addr_t ipaddr;
    struct netif *netif;
    struct eth_addr ethaddr;
    u16_t ctime;
    u8_t state;
  };
  //extern struct etharp_entry arp_table[];
  extern struct netif gnetif;


  osDelay(1000);

  ip_addr_t PC_IPADDR;
  IP_ADDR4(&PC_IPADDR, 192, 168, 1, 111);
  struct pbuf* udp_buffer = NULL;
  struct udp_pcb* my_udp = udp_new();
  udp_connect(my_udp, &PC_IPADDR, 55151);

  //struct eth_addr adres_eth;
  //extern int etharp_get_entry(size_t i, ip4_addr_t **ipaddr, struct netif **netif, struct eth_addr **eth_ret);



  /* Infinite loop */
  for (;;) {
    osDelay(100);
    /* !! PBUF_RAM is critical for correct operation !! */
    udp_buffer = pbuf_alloc(PBUF_TRANSPORT, strlen(message), PBUF_RAM);

    if (udp_buffer != NULL) {
      memcpy(udp_buffer->payload, message, strlen(message));
      udp_send(my_udp, udp_buffer);
      pbuf_free(udp_buffer);
    }

    BSP_LED_Toggle(0);
    BSP_TS_GetState(&touch);

    BSP_LCD_SelectLayer(0);
    sprintf(chNapis, "X=%d, Y=%d  ", touch.touchX[0], touch.touchY[0]);
    BSP_LCD_DisplayStringAt(KLAW_POZ_X, 220, (uint8_t*)chNapis, LEFT_MODE);
    sprintf(chNapis, "T=%d, W=%d  ", touch.touchDetected, touch.touchWeight[0]);
    BSP_LCD_DisplayStringAt(KLAW_POZ_X, 240, (uint8_t*)chNapis, LEFT_MODE);

    if (touch.touchDetected == 0)
    	chZrobione = 0;


    //przycisk zrób zdjęcie
    if ((touch.touchDetected >= 1) && (touch.touchX[0] >= KLAW_POZ_X)  && (touch.touchY[0] >= KLAW1_Y) && (touch.touchY[0] < (KLAW1_Y + KLAW_ROZ_Y)) && !chZrobione)
    {
    	BSP_CAMERA_SnapshotStart(bufor_okna);
    	chZrobione = 1;
    	chStartFraktal = 0;
    }

    //przycisk rozpocznij/zakończ film
    if ((touch.touchDetected >= 1) && (touch.touchX[0] >= KLAW_POZ_X)  && (touch.touchY[0] >= KLAW2_Y) && (touch.touchY[0] < (KLAW2_Y + KLAW_ROZ_Y)) && !chZrobione)
	{
    	if (chFilm)
    	{
    		BSP_CAMERA_Suspend();
    		sprintf(chNapis, "Start Film");
			chFilm = 0;
    	}
    	else
    	{
			BSP_CAMERA_ContinuousStart(bufor_okna);
			sprintf(chNapis, "Stop Film ");
			chFilm = 1;
    	}

    	//zmień status przycisku Start/Stop Film
		BSP_LCD_SelectLayer(0);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetBackColor(LCD_COLOR_GREEN);
		BSP_LCD_DisplayStringAt(KLAW_POZ_X+5, KLAW2_Y+NAPIS_OFFY, (uint8_t*)chNapis, LEFT_MODE);
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);	//przywróć kolor tła
    	chStartFraktal = 0;
    	chZrobione = 1;
	}

	//przycisk Monitor IP
	if ((touch.touchDetected >= 1) && (touch.touchX[0] >= KLAW_POZ_X)  && (touch.touchY[0] >= KLAW3_Y) && (touch.touchY[0] < (KLAW3_Y + KLAW_ROZ_Y)) && !chZrobione)
	{
		BSP_LCD_SelectLayer(1);
		BSP_LCD_Clear(LCD_COLOR_BLACK);

		sprintf(chNapis, "WHADDR: %d.%d.%d.%d.%d.%d ", gnetif.hwaddr[0], gnetif.hwaddr[1], gnetif.hwaddr[2], gnetif.hwaddr[3], gnetif.hwaddr[4], gnetif.hwaddr[5]);
		BSP_LCD_DisplayStringAt(5, 10, (uint8_t*)chNapis, LEFT_MODE);

