pitlab/Kamera-OV9655-na-STM32F746G-DISCO/Core/Src/main.c
		uniaIP.ip = gnetif.ip_addr;
		sprintf(chNapis, "IP Addr: %d.%d.%d.%d ", uniaIP.u8[0], uniaIP.u8[1],  uniaIP.u8[2],  uniaIP.u8[3]);
		BSP_LCD_DisplayStringAt(5, 25, (uint8_t*)chNapis, LEFT_MODE);

		//netif_status_callback_fn fun;
		//fun = gnetif.link_callback;
		//uniaIP.ip = fun->ip_addr;

		//sprintf(chNapis, "IP Addr: %d.%d.%d.%d ", uniaIP.u8[0], uniaIP.u8[1],  uniaIP.u8[2],  uniaIP.u8[3]);
		//BSP_LCD_DisplayStringAt(5, 40, (uint8_t*)chNapis, LEFT_MODE);

		//flagi są z pliku netif.h
		sprintf(chNapis, "FLAG_UP: %d ", gnetif.flags & NETIF_FLAG_UP);
		BSP_LCD_DisplayStringAt(5, 55, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_BROADCAST: %d", (gnetif.flags & NETIF_FLAG_BROADCAST) == NETIF_FLAG_BROADCAST);
		BSP_LCD_DisplayStringAt(5, 70, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_LINK_UP: %d ", (gnetif.flags & NETIF_FLAG_LINK_UP) == NETIF_FLAG_LINK_UP);
		BSP_LCD_DisplayStringAt(5, 85, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_ETHARP: %d", (gnetif.flags & NETIF_FLAG_ETHARP) == NETIF_FLAG_ETHARP);
		BSP_LCD_DisplayStringAt(5, 100, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_ETHERNET: %d", (gnetif.flags & NETIF_FLAG_ETHERNET) == NETIF_FLAG_ETHERNET);
		BSP_LCD_DisplayStringAt(5, 115, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_IGMP: %d ", (gnetif.flags & NETIF_FLAG_IGMP) == NETIF_FLAG_IGMP);
		BSP_LCD_DisplayStringAt(5, 130, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_MLD6: %d", (gnetif.flags & NETIF_FLAG_MLD6) == NETIF_FLAG_MLD6);
		BSP_LCD_DisplayStringAt(5, 145, (uint8_t*)chNapis, LEFT_MODE);

		//tablica ARP
		for (n=0; n<4; n++)
		{
			PobierzEthArp(n, &uniaIP.u32);
			//uniaIP.ip = arp_table[n].ipaddr;
			//sprintf(chNapis, "ARP[%d].IP: %d.%d.%d.%d, EthAdr:  %d.%d.%d.%d.%d.%d", n, uniaIP.u8[0], uniaIP.u8[1],  uniaIP.u8[2],  uniaIP.u8[3], arp_table[n].ethaddr.addr[0], arp_table[n].ethaddr.addr[1], arp_table[n].ethaddr.addr[2], arp_table[n].ethaddr.addr[3], arp_table[n].ethaddr.addr[4], arp_table[n].ethaddr.addr[5]);
			//sprintf(chNapis, "ARP[%d].IP: %d.%d.%d.%d, EthAdr:  %d.%d.%d.%d.%d.%d", n, uniaIP.u8[0], uniaIP.u8[1],  uniaIP.u8[2],  uniaIP.u8[3], adres_eth[0], adres_eth[1], adres_eth[2], adres_eth[3], adres_eth[4], adres_eth[5]);
			sprintf(chNapis, "ARP[%d].IP: %d.%d.%d.%d", n, uniaIP.u8[0], uniaIP.u8[1],  uniaIP.u8[2],  uniaIP.u8[3]);
			BSP_LCD_DisplayStringAt(5, 160+n*15, (uint8_t*)chNapis, LEFT_MODE);
		}

	}

	//przycisk fraktal
	if ((touch.touchDetected >= 1) && (touch.touchX[0] >= KLAW_POZ_X)  && (touch.touchY[0] >= KLAW4_Y) && (touch.touchY[0] < (KLAW4_Y + KLAW_ROZ_Y)) && !chZrobione)
	{
		InitFraktal(0);
		chStartFraktal = 1;
		chZrobione = 1;
	}



	if (chStartFraktal)
	{
		nCzas = HAL_GetTick();
		GenerateJulia(320, 240, 160, 120, 135, (unsigned short *)bufor_okna);
		fImag -= 0.002;
		nCzas = MinalCzas(nCzas);

		BSP_LCD_SelectLayer(1);
		sprintf(chNapis, "Julia: t=%ldms, c=%.3f ", nCzas, fImag);
		BSP_LCD_DisplayStringAt(6, 224, (uint8_t*)chNapis, LEFT_MODE);
	}

    /*BSP_LCD_SetTransparency(0, chTransparency);
    sprintf(buftxt, "transp: %d", chTransparency);
    BSP_LCD_DisplayStringAt(0, 30, (uint8_t*)buftxt, LEFT_MODE);
    chTransparency++;
    chTransparency &= 0xFF;*/
  }
  /* USER CODE END 5 */
}

 /* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.BaseAddress = 0x20010000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_128KB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  MPU_InitStruct.BaseAddress = 0x2004C000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_512B;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
